#+TITLE: Snort-báo-cáo
*** Về Mod-security:
#+begin_comment
Understanding ModSecurity
ModSecurity is a hybrid web application firewall that relies on the host web server for some of the work. The only supported web server at the moment is Apache 2.x, but it is possible, in principle, to integrate ModSecurity with any other web server that provides sufficient
integration APIs.
Apache does for ModSecurity what it does for all other modules—it handles the infrastruc- ture tasks:
1. Decrypts SSL
2. Breaks up the inbound connection stream into HTTP requests
3. Partially parses HTTP requests
#+end_comment
- ModSecurity là một hydrid web-application firewall phụ thuộc vào host là máy chủ mà nó bảo vệ để cùng hoạt động. Nó chỉ support Apache, tuy nhiên có hỗ trợ API để kết hợp với các web khác
#+begin_comment
Understanding ModSecurity
Apache does for ModSecurity what it does for all other modules—it handles the infrastruc- ture tasks:
1. Decrypts SSL
2. Breaks up the inbound connection stream into HTTP requests
3. Partially parses HTTP requests
Request line and headers are NUL-terminated
This is normally not a problem, because what Apache doesn’t see cannot harm any module or application. In some very rare cases, however, the purpose of the NUL- byte evasion is to hide things and this Apache behavior only helps with the hiding. Request header transformation Apache will canonicalize request headers, combining multiple headers that use the same name and collapsing those that span two or more lines. The transformation may make it difficult to detect subtle signs of evasion, but in practice this hasn’t been a problem yet.
#+end_comment
- Nó phải phụ thuộc vào Apache để phân giải SSL, HTTP request nên gọi là hydrid firewall
#+begin_comment
Quick request handling Apache will handle some requests quickly, leaving ModSecurity unable to do any- thing but notice them in the logging phase. Invalid HTTP requests, in particular, will be rejected by Apache without ModSecurity having a say. No access to some response headers Because of the way Apache works, the Server and Date response headers are invisible to ModSecurity; they cannot be inspected or logged.
#+end_comment
- 4 chức năng chính của modsec:
  - Parsing: phân tích các gói data để áp rules lên
  - buffering: nghĩa là gói các request và response lại nhằm đảm bảo sự hoàn chính của mỗi request/response khi phân tích. Dĩ nhiên sẽ làm tốn RAM hơn
  - Logging: Log full transaction
  - Rule Engine: cung cấp hệ thống rules hoàn chỉnh và áp đặt rule đó lên mỗi transaction
    
#+begin_comment
What Rules Look Like
Everything in ModSecurity revolves around two things: configuration and rules. The configuration tells ModSecurity how to process the data it sees; the rules decide what to do with the processed data. Although it is too early to go into how the rules work, I will show you a quick example here just to give you an idea what they look like.
For example:
SecRule ARGS "<script>" log,deny,status:404
Even without further assistance, you can probably recognize the part in the rule that specifies what we wish to look for in input data (<script>). Similarly, you will easily figure out what will happen if we do find the desired pattern (log,deny,status:404). Things will become more clear if I tell you about the general rule syntax, which is the following:
SecRule VARIABLES OPERATOR ACTIONS
The three parts have the following meanings:
1. The VARIABLES part tells ModSecurity where to look. The ARGS variable, used in the
example, means all request parameters.
2. The OPERATOR part tells ModSecurity how to look. In the example, we have a regular
expression pattern, which will be matched against ARGS.
3. The ACTIONS part tells ModSecurity what to do on a match. The rule in the example gives three instructions: log problem, deny transaction and use the status 404 for the denial (status:404).
I hope you are not dissapointed with the simplicity of this first rule. I promise you that by combining the various facilities offered by ModSecurity, you will be able to write very useful rules that implement complex logic where necessary.
#+end_comment
- Rules và transaction: ở modsec có khái niệm transaction, chỉ một giai đoạn hoàn chỉnh từ lúc request đi qua firewall vào host và response từ host -> ra ngoài firewall. Gồm 5 phase:
  - Request Header(1) -> Request Body (2) -> Response Headers (3) -> Response Body (4) -> logging (5). Cơ chế hoạt động là áp rules lên trước khi mod thực hiện phân tích thành phần tương ứng với tên phase. Nghĩa là rules áp lên phase 1 sẽ thực thi trước cả khi parse header request và rules ở phase 5 thực thi sau khi parse xong response body và trước khi log
    - Mỗi rules luôn có dạng
        #+begin_example
    SecRule Variables operator/filter actions
        #+end_example
    - Theo [[https://coreruleset.org/docs/][https://coreruleset.org/docs/]], có tổng cổng 105 variable, 36 operator,35 transsformation,47 actions trong ModSec. nghĩa là có ít nhất
        #+begin_src perl
    105*36*35*47

        #+end_src

        #+RESULTS:
        : 6218100 minimum rules combination, chưa tính việc một rule có thể chain với rule khác, hay khái niệm variable trong modsec thực chất mặc định là một collection, nghĩa là có thể chia nhỏ ra nhiều variable nhỏ hơn

    - Tuy nhiên thực tế, chỉ có một số rule thông dụng.
    - Với sự phong phú về rules như thế , modsec là firewall mạnh mẽ nhất của Apache ở phương diện web application.

    - Bài viết này, vì giới hạn thời gian (1 tháng) và nhóm còn bận nhiều việc khác. Nên không xoáy sâu vào những phần phức tạp hơn như logging, hay core-rules sec, hay Lua script...

    - Data persisten: ngoài cơ chế chia theo transition/phase, modsec còn quản lý dữ liệu theo data persisten mechanism, nghĩa là mỗi collection sẽ được lưu lại với một khoảng timeout nhất định, theo mặc định là 3600s. Nói cho dễ hiệu, ta có collection IP, một collection mặc định từ Apache 2.5x trở lên, nó lưu lại mọi địa chỉ IP qua lại giữa modsec firewall, nếu chỉ hoạt động theo transition/phase, thì mỗi ip sẽ bị xoá đi ngay sau khi nó đi vào/ra khỏi firewall, tuy nhiên cơ chế dp sẽ lưu lại mỗi địa chỉ ip trong 3600s. Cơ chế này được dùng rất nhiều, ví dụ ta dùng collection IP để chống lại DOS, bằng cách tạo một variable IP.counter và đếm số lần mỗi IP xuất hiện nhằm allow,block. 

    - Một số ví dụ:
#+begin_src apache
       # block mọi request từ 10.0.0.1
       SecRule REMOTE_ADDR "streq 10.0.0.1" "id:1000, phase:1, block,log"
     # Dùng perl regrex, filter 192.168.1.{1-5}, không log
       SecRule REMOTE_ADDR "@rx ^192\.168\.1\.(1|5|10)$" \
       phase:1,nolog,allow
   # SEcAction là secrule đặc biệt không cần phải có variable và filter, nghĩa là sẽ thực thi không điều kiện các action sau.
       #Ở đây là khởi tạo, tăng biến IP.couter lên 1 đơn vị. UPDATE_RATE là built-in variable cho collection IP, số request mỗi giây. Nghĩa là ta block mọi ip mà gửi hơn 5 requesst mỗi giây
       SecAction phase:1,nolog,pass,setvar:IP.counter=+1
       SecRule IP:UPDATE_RATE "@gt 5" \
   "phase:1,block,msg:IP này gửi hơn 5 request mỗi giây: %{IP.UPDATE_RATE},có thể dos"
#+end_src
#+begin_example
- Modsec là firewall ở application level, không dùng để chặn DOS tư ICMP, TCP, UDP... 
#+end_example
